fan_finder/app/controllers/api/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @post = Post.find(@message.post_id)
    unless @message.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "messages" ("post_id", "user_id", "name", "message") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["user_id", 2], ["name", "asf"], ["message", "asf"]]