fan_finder/app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC
---
def index
  @posts = Post.all

INSERT INTO "posts" ("user_id", "title", "content", "team", "event", "date", "location") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["title", "Big game!"], ["content", "Anyone wanna watch???"], ["team", "Philadelphia Eagles"], ["event", "Monday Night Football"], ["date", "Monday Night"], ["location", "Chicago"]]
---
def create
  @post = Post.new(post_params)
  puts params
  if @post.valid?
     @post.save