fan_finder/app/controllers/api/posts_controller.rb

def index
  @posts = Post.order(:date)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."date" ASC