fan_finder/app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "michaelklopman@gmail.com"], ["LIMIT", 1]]
---
  def create

	  @user = User.find_by_email(params[:email].downcase)