fan_finder/app/controllers/api/users_controller.rb

  def create
    puts user_params.inspect()
    @user = User.new(user_params)

    if @user.valid?

      @user.save()
---
INSERT INTO "users" ("name", "email", "password_digest", "auth_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Michael Klopman"], ["email", "michaelklopman@gmail.com"], ["password_digest", "$2a$10$DeN1RcAOco0imA7FkelxuOhvzwGAYfEKMPZE7E6fn7PCMBgFqOt12"], ["auth_token", "A5HG3QgqHBmGcJbc68xLZDfW"]]